{
  "examples": [
    {
      "id": 1,
      "persona": "arun",
      "title": "Arun's text",
      "original_text": "The <nf>Haneto costume</nf> worn at Aomori's <nf>Nebuta Matsuri</nf> is one of Japan's most recognizable <sf>festival outfits</sf>. It is the <sf>traditional clothing</sf> for dancers in the Aomori festival and includes a white <nf>yukata</nf> with blue patterns, a triangular straw hat decorated with flowers called a <nf>hanagasa</nf>, a yellow waistband, and a sash called a <nf>tasuki</nf>. Dancers also wear <nf>tabi socks</nf> and <nf>zōri sandals</nf>, and they may attach small bells to their costume. <sf>Japanese festivals</sf> often feature popular foods such as <sf>sushi</sf>, <sf>ramen</sf>, and <sf>takoyaki</sf> that are now popular worldwide. Aomori, where Nebuta Matsuri takes place, is also known for its <sf>natural landscapes</sf> and <sf>coastal views</sf>, making it a well-known travel destination in Japan.",
      "gentle_rewrite": "The <u>traditional festival dancer outfit</u> worn at Aomori’s <u>Nebuta Matsuri, a famous festival in northern Japan</u>, is one of Japan’s most recognizable <u>festival outfits</u>. It is the <u>traditional clothing</u> for dancers and includes a white <u>light cotton robe worn in summer (yukata)</u> with blue patterns, a <u>flower-decorated straw hat (hanagasa)</u>, a yellow waistband, and a <u>cloth band used to tie sleeves (tasuki)</u>. Dancers also wear <u>split-toe socks (tabi)</u> and <u>flat traditional sandals (zōri)</u>, and they may attach small bells to their costume. <u>Cultural celebrations in Japan</u> often feature popular foods such as <u>rice rolls with fish or vegetables (sushi)</u>, <u>noodle soup (ramen)</u>, and <u>fried snack balls (takoyaki)</u> that are now popular worldwide. Aomori, where Nebuta Matsuri takes place, is also known for <u>mountains, forests, and open nature</u>, as well as <u>views of the sea and beaches</u>, making it a well-known travel destination in Japan.",
      "full_rewrite": "<u>During a major cultural celebration in northern Japan called Nebuta Matsuri</u>, dancers wear a <u>special traditional outfit</u> that is widely recognized across the country. This outfit includes a <u>light cotton robe similar to a simple kurta (yukata)</u>, a <u>flower-decorated straw hat</u>, a yellow belt, and a <u>cloth band used to tie up sleeves so dancers can move freely</u>. The dancers also wear <u>split-toe socks and flat sandals, similar to basic chappals</u>, and sometimes add <u>small bells that make sound while dancing</u>. Like <u>Indian festivals with street food</u>, Japanese festivals offer <u>well-known dishes</u> such as <u>rice rolls (sushi)</u>, <u>noodle soup (ramen)</u>, and <u>fried snack balls similar to paniyaram (takoyaki)</u>. The region of Aomori is also famous for its <u>mountains, forests, and seaside areas</u>, which makes it a <u>popular place for tourists visiting Japan</u>.",
      "tagged_phrases": [
        {
          "phrase": "Haneto costume",
          "tag": "not_familiar",
          "explanation": "A specific Japanese name; describing its function makes it clearer.",
          "simpler": "traditional festival dancer outfit"
        },
        {
          "phrase": "Nebuta Matsuri",
          "tag": "not_familiar",
          "explanation": "Festival names are unfamiliar without location or context.",
          "simpler": "a famous festival in northern Japan"
        },
        {
          "phrase": "yukata",
          "tag": "not_familiar",
          "explanation": "Traditional clothing term; needs description (similar to a simple kurta worn at home).",
          "simpler": "light cotton robe worn in summer"
        },
        {
          "phrase": "hanagasa",
          "tag": "not_familiar",
          "explanation": "The Japanese name hides the actual meaning.",
          "simpler": "straw hat decorated with flowers"
        },
        {
          "phrase": "tasuki",
          "tag": "not_familiar",
          "explanation": "Very specific accessory; function-based explanation helps.",
          "simpler": "cloth band used to tie sleeves"
        },
        {
          "phrase": "tabi socks",
          "tag": "not_familiar",
          "explanation": "Uncommon clothing item outside Japan.",
          "simpler": "split-toe socks worn with sandals"
        },
        {
          "phrase": "zōri sandals",
          "tag": "not_familiar",
          "explanation": "Can be related to simple Indian chappals.",
          "simpler": "flat traditional sandals"
        },
        {
          "phrase": "festival outfits",
          "tag": "somewhat_familiar",
          "explanation": "Clarifies purpose for general readers.",
          "simpler": "special clothes worn during festivals"
        },
        {
          "phrase": "traditional clothing",
          "tag": "somewhat_familiar",
          "explanation": "Makes the idea more concrete.",
          "simpler": "clothes worn for cultural events"
        },
        {
          "phrase": "Japanese festivals",
          "tag": "somewhat_familiar",
          "explanation": "Adds context for readers outside Japan.",
          "simpler": "cultural celebrations in Japan"
        },
        {
          "phrase": "sushi",
          "tag": "somewhat_familiar",
          "explanation": "Many know the word but not the details.",
          "simpler": "rice rolls with fish or vegetables"
        },
        {
          "phrase": "ramen",
          "tag": "somewhat_familiar",
          "explanation": "Clarifies what kind of food it is.",
          "simpler": "noodle soup dish"
        },
        {
          "phrase": "takoyaki",
          "tag": "somewhat_familiar",
          "explanation": "The name is known",
          "simpler": "fried snack balls"
        },
        {
          "phrase": "natural landscapes",
          "tag": "somewhat_familiar",
          "explanation": "forests",
          "simpler": "mountains"
        },
        {
          "phrase": "coastal views",
          "tag": "somewhat_familiar",
          "explanation": "Simpler wording improves clarity.",
          "simpler": "views of the sea and beaches"
        }
      ]
    },
    {
      "id": 2,
      "persona": "maria",
      "title": "Maria's text",
      "original_text": "<sf>South Indian breakfasts</sf> are a <sf>celebration of comfort and flavour</sf>. The iconic <nf>masala dosa</nf>, golden and crispy, is a must-try—best enjoyed <sf>piping hot</sf> with a strong cup of tea, an <sf>unbeatable combination</sf> for any food lover. The accompanying <nf>chutney</nf> is <sf>spot on</sf>: spicy, fresh, and <sf>bursting with flavour</sf>, elevating every bite of the dosa. Equally popular is <nf>filter coffee</nf>, famous for its <sf>rich aroma and bold taste</sf>, making mornings instantly better. For those who prefer softer textures, <nf>idly</nf> is a <sf>wholesome and healthy choice</sf>, often praised as one of the lightest breakfasts. Steamed to perfection, it pairs beautifully with <nf>red and green chutneys</nf>. Don't miss the <sf>indulgent</sf> <nf>Mangalore bun</nf> either—slightly sweet, fluffy, and perfect with chutney. Served very hot, these South Indian classics offer a <sf>satisfying and memorable breakfast experience</sf>.",
      "gentle_rewrite": "South Indian breakfasts are known for being <u>very tasty and comforting</u>. The famous <u>masala dosa, a thin Indian crepe filled with spiced potatoes</u>, is golden and crispy. It tastes best when served <u>very hot and fresh</u>, along with a <u>strong cup of tea</u>, which makes a great food pairing. The side sauce, called <u>chutney (a spicy Indian sauce)</u>, is fresh and spicy and adds a lot of flavour to each bite. Another popular drink is <u>filter coffee, a traditional Indian coffee</u>, known for its strong smell and bold taste. If you like soft foods, <u>idly, soft steamed rice cakes</u>, are a healthy and light option. They are steamed until soft and eaten with <u>red and green spicy sauces</u>. You can also try <u>Mangalore bun, a soft and slightly sweet fried bread</u>, which tastes best when served very hot. Together, these dishes make a <u>filling and enjoyable breakfast</u>.",
      "full_rewrite": "South Indian breakfast foods are <u>warm, comforting, and full of flavour</u>. One of the most popular dishes is <u>masala dosa, a thin Indian crepe filled with gently spiced mashed potatoes</u>. It is crispy on the outside and soft inside. People enjoy it best when it is <u>served very hot</u>, often with <u>a strong cup of tea</u>. Dosa is eaten with <u>chutney, a spicy Indian dipping sauce</u>. The chutney is fresh and adds strong flavour to every bite. Many people also drink <u>filter coffee, a traditional Indian coffee made using a metal filter</u>, which has a deep smell and strong taste. If you prefer soft and light foods, <u>idly are a great choice</u>. <u>Idly are soft, steamed rice cakes</u> that are easy to eat and gentle on the stomach. They are usually served with <u>red and green spicy sauces</u>. Another popular item is <u>Mangalore bun</u>, which is <u>a fluffy, slightly sweet fried bread</u>. It feels rich and filling and is best eaten hot. These foods together create <u>a simple, filling, and enjoyable breakfast</u> that many people love.",
      "tagged_phrases": [
        {
          "phrase": "South Indian breakfasts",
          "tag": "somewhat_familiar",
          "explanation": "User may know India",
          "simpler": "Breakfast foods from South India"
        },
        {
          "phrase": "celebration of comfort and flavour",
          "tag": "somewhat_familiar",
          "explanation": "Abstract phrase that may feel vague or figurative",
          "simpler": "Very tasty and comforting food"
        },
        {
          "phrase": "masala dosa",
          "tag": "not_familiar",
          "explanation": "Specific cultural food item unfamiliar to many US users",
          "simpler": "Indian crepe filled with spiced potatoes"
        },
        {
          "phrase": "piping hot",
          "tag": "somewhat_familiar",
          "explanation": "Idiomatic phrase may cause confusion",
          "simpler": "Very hot and fresh"
        },
        {
          "phrase": "unbeatable combination",
          "tag": "somewhat_familiar",
          "explanation": "Figurative language may be unclear",
          "simpler": "Very good match"
        },
        {
          "phrase": "chutney",
          "tag": "not_familiar",
          "explanation": "Food term unfamiliar outside Indian cuisine",
          "simpler": "Spicy Indian sauce"
        },
        {
          "phrase": "spot on",
          "tag": "somewhat_familiar",
          "explanation": "Idiomatic phrase",
          "simpler": "Perfect"
        },
        {
          "phrase": "bursting with flavour",
          "tag": "somewhat_familiar",
          "explanation": "Figurative expression",
          "simpler": "Full of strong taste"
        },
        {
          "phrase": "filter coffee",
          "tag": "not_familiar",
          "explanation": "Specific preparation style unfamiliar",
          "simpler": "Traditional Indian coffee made with a filter"
        },
        {
          "phrase": "rich aroma and bold taste",
          "tag": "somewhat_familiar",
          "explanation": "Descriptive but abstract wording",
          "simpler": "Strong smell and strong taste"
        },
        {
          "phrase": "idly",
          "tag": "not_familiar",
          "explanation": "Unknown food name",
          "simpler": "Soft steamed rice cakes"
        },
        {
          "phrase": "wholesome and healthy choice",
          "tag": "somewhat_familiar",
          "explanation": "Abstract health wording",
          "simpler": "Healthy and filling food"
        },
        {
          "phrase": "red and green chutneys",
          "tag": "not_familiar",
          "explanation": "Plural and color-based food terms unfamiliar",
          "simpler": "Red and green spicy sauces"
        },
        {
          "phrase": "Mangalore bun",
          "tag": "not_familiar",
          "explanation": "slightly sweet fried bread",
          "simpler": "Soft"
        },
        {
          "phrase": "indulgent",
          "tag": "somewhat_familiar",
          "explanation": "Abstract adjective",
          "simpler": "Rich and treats-like"
        },
        {
          "phrase": "satisfying and memorable breakfast experience",
          "tag": "somewhat_familiar",
          "explanation": "Long abstract phrase",
          "simpler": "Very filling and enjoyable breakfast"
        }
      ]
    },
    {
      "id": 3,
      "persona": "sruti",
      "title": "Sruti's text",
      "original_text": "This café instantly <sf>felt cozy</sf>, with a <sf>warm ambience</sf> and the <nf>comforting aroma of freshly ground coffee</nf> filling the space. Sitting inside was especially inviting, making it a perfect spot to slow down and enjoy the moment. I tried their signature Cinnamon Latte, which had a <sf>rich, smooth flavor</sf> with a <sf>delightful hint of cinnamon</sf> that elevated the entire experience. <nf>The aroma alone was irresistible</nf>. I also picked up their special candle, and it now <nf>fills my home with a soothing, calming scent</nf>. Overall, this place offers more than just great coffee—it's an experience. I'd definitely recommend it to anyone looking for comfort, flavor, and a touch of warmth.",
      "gentle_rewrite": "This café instantly felt cozy, with <u>soft lighting and warm interior colors creating a relaxing space</u>. Sitting inside was especially inviting, making it a perfect spot to slow down and enjoy the moment. I tried their signature Cinnamon Latte, which had a <u>full-bodied, well-balanced taste with a noticeable cinnamon flavor</u> that elevated the experience. <u>The drink stood out for its comforting and familiar flavor.</u> I also picked up their special candle, and it <u>creates a cozy atmosphere at home with its soft glow and calming presence</u>. Overall, this place offers more than just great coffee—it’s an experience. I’d definitely recommend it.",
      "full_rewrite": "This café feels welcoming through its <u>soft lighting, warm colors, and calm indoor setting</u>, making it an easy place to relax and spend time. Sitting inside feels comfortable and unhurried. I tried their signature Cinnamon Latte, which is <u>full-bodied and pleasantly balanced, with a clear cinnamon flavor that many regulars enjoy</u>. It’s a drink that feels <u>familiar and satisfying rather than overwhelming</u>. I also bought their special candle, which <u>adds to the atmosphere at home with gentle light and a calming presence</u>. Overall, the café focuses on <u>comfort, thoughtful details, and quality</u>. I would strongly recommend it to anyone looking for a <u>relaxed and enjoyable café experience</u>.",
      "tagged_phrases": [
        {
          "phrase": "comforting aroma of freshly ground coffee",
          "tag": "not_familiar",
          "explanation": "Smell-based description is inaccessible; replaced with sound and environment cues.",
          "simpler": "the sound of coffee being prepared and the calm atmosphere inside"
        },
        {
          "phrase": "The aroma alone was irresistible",
          "tag": "not_familiar",
          "explanation": "Explains appeal without relying on smell.",
          "simpler": "the drink stood out because of its balanced and comforting taste"
        },
        {
          "phrase": "fills my home with a soothing, calming scent",
          "tag": "not_familiar",
          "explanation": "Shifts from scent to visual and emotional cues.",
          "simpler": "creates a cozy atmosphere with its soft glow and calming presence"
        },
        {
          "phrase": "warm ambience",
          "tag": "somewhat_familiar",
          "explanation": "Makes ambience concrete and visually clear.",
          "simpler": "soft lighting and warm interior colors"
        },
        {
          "phrase": "felt cozy",
          "tag": "somewhat_familiar",
          "explanation": "Clarifies the feeling without sensory assumptions.",
          "simpler": "felt relaxing and comfortable to spend time in"
        },
        {
          "phrase": "rich, smooth flavor",
          "tag": "somewhat_familiar",
          "explanation": "Simplifies taste description into familiar terms.",
          "simpler": "full-bodied and well-balanced taste"
        },
        {
          "phrase": "delightful hint of cinnamon",
          "tag": "somewhat_familiar",
          "explanation": "Grounded in taste rather than smell.",
          "simpler": "a noticeable cinnamon flavor that adds warmth to the drink"
        }
      ]
    },
    {
      "id": 4,
      "persona": "george",
      "title": "George's text",
      "original_text": "<sf>Leaves rustled in the evening breeze</sf>, <nf>a dry whisper like secrets the day was done confessing</nf>. Inside the hall, <sf>his voice thundered across the room</sf>, <nf>not loud so much as inevitable</nf>, <nf>a storm that demanded everyone stand still and listen</nf>. Later, when <nf>the house exhaled into quiet</nf>, <sf>raindrops drummed against the window</sf>, steady and patient, <nf>counting time the way a heart counts hope</nf>. <sf>The alarm blared at dawn</sf>, a rude insistence that <nf>dreams were no longer valid currency</nf>. Outside, <sf>the crowd roared in approval</sf> <nf>as if joy itself had found lungs</nf>. In the kitchen, the kettle whistled on the stove, <nf>sharp and pleading</nf>, while <sf>the phone chimed cheerfully</sf>, <nf>pretending urgency could be friendly</nf>. By nightfall, <sf>the wind howled through the dark streets</sf>, <nf>a feral choir circling the walls</nf>, reminding him that <nf>sound was never just noise</nf>. It was warning, comfort, memory, and proof that the world was still awake, even when he wanted to be anything but.",
      "gentle_rewrite": "Leaves <u>moved gently</u> in the evening breeze, <u>creating a quiet feeling as the day ended</u>. Inside the hall, <u>he spoke with great force and authority</u>, <u>making it impossible to ignore</u>, <u>and everyone paid attention</u>. Later, when the house <u>became calm and still</u>, <u>raindrops hit steadily against the window</u>, <u>as time passed slowly and thoughtfully</u>. <u>The alarm signaled the start of the day</u>, a rude reminder that dreams were over. Outside, <u>the crowd showed great enthusiasm and excitement</u>, <u>as if happiness was clearly visible</u>. In the kitchen, <u>the kettle signaled it was ready</u>, <u>strongly demanding attention</u>, while <u>the phone gave a clear signal for attention</u>, <u>trying to seem important but polite</u>. By nightfall, <u>the wind blew strongly through the dark streets</u>, <u>moving wildly around the buildings</u>, reminding him that <u>events were never meaningless</u>. <u>They could show danger, safety, or memories</u>, and <u>life continued around him</u>, even when he wanted to rest.",
      "full_rewrite": "In the evening, <u>the leaves moved gently in the breeze</u>, showing that the day was ending. Inside the hall, <u>the man spoke with strong authority</u>, and <u>everyone focused on him immediately</u>. Later, <u>the house became quiet and calm</u>, and <u>raindrops hit the window at a steady pace</u>, marking the slow passing of time. At dawn, <u>the alarm showed it was time to wake up</u>, ending his dreams. Outside, <u>a large group of people showed excitement and approval through their actions</u>. In the kitchen, <u>the kettle showed it was ready</u>, while <u>the phone gave a clear alert that needed attention</u>. At night, <u>strong wind moved through the empty streets</u>, <u>surrounding the buildings</u>. It reminded him that <u>what happens around us always has meaning</u>. <u>These moments can warn us, comfort us, or remind us of the past</u>, and <u>the world keeps going</u>, even when he feels tired and wants everything to stop.",
      "tagged_phrases": [
        {
          "phrase": "Leaves rustled in the evening breeze",
          "tag": "somewhat_familiar",
          "explanation": "Original relies on sound imagery; simpler version focuses on visible movement.",
          "simpler": "Leaves moved gently in the evening breeze"
        },
        {
          "phrase": "a dry whisper like secrets the day was done confessing",
          "tag": "not_familiar",
          "explanation": "Metaphor depends on sound and abstract ideas like secrets.",
          "simpler": "A quiet feeling as the day ended"
        },
        {
          "phrase": "his voice thundered across the room",
          "tag": "somewhat_familiar",
          "explanation": "Thunder is sound-based; alternative explains meaning clearly.",
          "simpler": "He spoke with great force and authority"
        },
        {
          "phrase": "not loud so much as inevitable",
          "tag": "not_familiar",
          "explanation": "Abstract wording may feel unclear.",
          "simpler": "Impossible to ignore"
        },
        {
          "phrase": "a storm that demanded everyone stand still and listen",
          "tag": "not_familiar",
          "explanation": "Metaphor relies on sound and emotion.",
          "simpler": "His presence made everyone pay attention"
        },
        {
          "phrase": "the house exhaled into quiet",
          "tag": "not_familiar",
          "explanation": "Figurative and abstract; “exhaled” is unclear visually.",
          "simpler": "The house became calm and still"
        },
        {
          "phrase": "raindrops drummed against the window",
          "tag": "somewhat_familiar",
          "explanation": "Sound-based verb replaced with visible action.",
          "simpler": "Raindrops hit steadily against the window"
        },
        {
          "phrase": "counting time the way a heart counts hope",
          "tag": "not_familiar",
          "explanation": "Highly abstract metaphor.",
          "simpler": "Time passed slowly and meaningfully"
        },
        {
          "phrase": "The alarm blared at dawn",
          "tag": "somewhat_familiar",
          "explanation": "Sound-based; alternative removes noise reference.",
          "simpler": "The alarm signaled the start of the day"
        },
        {
          "phrase": "dreams were no longer valid currency",
          "tag": "not_familiar",
          "explanation": "Metaphorical and abstract phrase.",
          "simpler": "Dreams were over and it was time to wake up"
        },
        {
          "phrase": "the crowd roared in approval",
          "tag": "somewhat_familiar",
          "explanation": "Sound imagery replaced with emotional meaning.",
          "simpler": "The crowd showed great enthusiasm and excitement"
        },
        {
          "phrase": "as if joy itself had found lungs",
          "tag": "not_familiar",
          "explanation": "Abstract metaphor tied to sound.",
          "simpler": "People expressed strong happiness"
        },
        {
          "phrase": "sharp and pleading",
          "tag": "not_familiar",
          "explanation": "Emotional sound description is abstract.",
          "simpler": "Strong and demanding attention"
        },
        {
          "phrase": "the phone chimed cheerfully",
          "tag": "somewhat_familiar",
          "explanation": "Removes emotional tone tied to sound.",
          "simpler": "The phone gave a clear signal for attention"
        },
        {
          "phrase": "pretending urgency could be friendly",
          "tag": "not_familiar",
          "explanation": "Abstract personification.",
          "simpler": "Trying to seem important but polite"
        },
        {
          "phrase": "the wind howled through the dark streets",
          "tag": "somewhat_familiar",
          "explanation": "Sound metaphor simplified to physical action.",
          "simpler": "The wind blew strongly through the night"
        },
        {
          "phrase": "a feral choir circling the walls",
          "tag": "not_familiar",
          "explanation": "Highly figurative and sound-dependent.",
          "simpler": "Wild wind moved around the buildings"
        },
        {
          "phrase": "sound was never just noise",
          "tag": "not_familiar",
          "explanation": "Abstract reflection.",
          "simpler": "Events always had meaning"
        }
      ]
    }
  ]
}
